app/Http/Controllers/Api/AssetsController.php

            $filter = json_decode($request->input('filter'), true);
        }

        $all_custom_fields = CustomField::all(); //used as a 'cache' of custom fields throughout this page load
---
select * from `stet_custom_fields`