app/Http/Controllers/Api/CategoriesController.php

select count(*) as aggregate from `stet_categories` where `stet_categories`.`deleted_at` is null
select `id`, `created_at`, `updated_at`, `name`, `category_type`, `use_default_eula`, `eula_text`, `require_acceptance`, `checkin_email`, `image`, (select count(*) from `stet_assets` inner join `stet_models` on `stet_models`.`id` = `stet_assets`.`model_id` where `stet_models`.`deleted_at` is null and `stet_categories`.`id` = `stet_models`.`category_id` and `stet_models`.`deleted_at` is null and `stet_assets`.`deleted_at` is null) as `assets_count`, (select count(*) from `stet_accessories` where `stet_categories`.`id` = `stet_accessories`.`category_id` and `stet_accessories`.`deleted_at` is null) as `accessories_count`, (select count(*) from `stet_consumables` where `stet_categories`.`id` = `stet_consumables`.`category_id` and `stet_consumables`.`deleted_at` is null) as `consumables_count`, (select count(*) from `stet_components` where `stet_categories`.`id` = `stet_components`.`category_id` and `stet_components`.`deleted_at` is null) as `components_count`, (select count(*) from `stet_licenses` where `stet_categories`.`id` = `stet_licenses`.`category_id` and `stet_licenses`.`deleted_at` is null) as `licenses_count` from `stet_categories` where `stet_categories`.`deleted_at` is null order by `assets_count` desc limit 20 offset 0
---
    public function index(Request $request)
    {
        $this->authorize('view', Category::class);
        $allowed_columns = ['id', 'name','category_type', 'category_type','use_default_eula','eula_text', 'require_acceptance','checkin_email', 'assets_count', 'accessories_count', 'consumables_count', 'components_count','licenses_count', 'image'];

        $categories = Category::select(['id', 'created_at', 'updated_at', 'name','category_type','use_default_eula','eula_text', 'require_acceptance','checkin_email','image'])
            ->withCount('assets as assets_count', 'accessories as accessories_count', 'consumables as consumables_count', 'components as components_count','licenses as licenses_count');

        if ($request->filled('search')) {
            $categories = $categories->TextSearch($request->input('search'));
        }

        // Set the offset to the API call's offset, unless the offset is higher than the actual count of items in which
        // case we override with the actual count, so we should return 0 items.
        $offset = (($categories) && ($request->get('offset') > $categories->count())) ? $categories->count() : $request->get('offset', 0);

        // Check to make sure the limit is not higher than the max allowed
        ((config('app.max_results') >= $request->input('limit')) && ($request->filled('limit'))) ? $limit = $request->input('limit') : $limit = config('app.max_results');

        $order = $request->input('order') === 'asc' ? 'asc' : 'desc';
        $sort = in_array($request->input('sort'), $allowed_columns) ? $request->input('sort') : 'assets_count';
        $categories->orderBy($sort, $order);

        $total = $categories->count();
        $categories = $categories->skip($offset)->take($limit)->get();