app/Http/Controllers/Assets/AssetsController.php

select * from `stet_companies` where `stet_companies`.`id` is null limit 1
---
    public function index(Request $request)
    {
        $this->authorize('index', Asset::class);
        $company = Company::find($request->input('company_id'));