app/Listeners/LogSuccessfulLogin.php

insert into `stet_login_attempts` (`username`, `user_agent`, `remote_ip`, `successful`, `created_at`) values ('anne.fernanda@binapertiwi.co.id', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/114.0.0.0 Safari/537.36', '43.252.73.98', 1, '2023-06-06 03:35:27')
---
    public function handle(Login $event)
    {
        $now = new Carbon();

        try {

            DB::table('login_attempts')->insert(
                [
                    'username' => $event->user->username,
                    'user_agent' => request()->header('User-Agent'),
                    'remote_ip' => request()->ip(),
                    'successful' => 1,
                    'created_at' => $now,
                ]
            );