app/Helpers/Helper.php

select `stet_accessories`.*, (select count(*) from `stet_users` inner join `stet_accessories_users` on `stet_users`.`id` = `stet_accessories_users`.`assigned_to` where `stet_accessories`.`id` = `stet_accessories_users`.`accessory_id`) as `users_count` from `stet_accessories` where `min_amt` is not null and `stet_accessories`.`deleted_at` is null
select `stet_components`.*, (select count(*) from `stet_assets` inner join `stet_components_assets` on `stet_assets`.`id` = `stet_components_assets`.`asset_id` where `stet_components`.`id` = `stet_components_assets`.`component_id` and `stet_assets`.`deleted_at` is null) as `assets_count` from `stet_components` where `min_amt` is not null and `stet_components`.`deleted_at` is null
---
    public static function checkLowInventory()
    {
        $consumables = Consumable::withCount('consumableAssignments as consumable_assignments_count')->whereNotNull('min_amt')->get();
        $accessories = Accessory::withCount('users as users_count')->whereNotNull('min_amt')->get();
        $components = Component::withCount('assets as assets_count')->whereNotNull('min_amt')->get();