app/Http/Controllers/DashboardController.php

    public function getIndex()
    {
        // Show the page
        if (Auth::user()->hasAccess('admin')) {

            $asset_stats=null;

            $counts['asset'] = \App\Models\Asset::where('assets.asset_tag', 'like', '3%')->count();
            $counts['asset_lva'] = \App\Models\Asset::where('assets.asset_tag', 'like', '9%')->count();
            $counts['accessory'] = \App\Models\Accessory::count();
            $counts['license'] = \App\Models\License::assetcount();
            $counts['consumable'] = \App\Models\Consumable::count();
---
select count(*) as aggregate from `stet_accessories` where `stet_accessories`.`deleted_at` is null
select count(*) as aggregate from `stet_consumables` where `stet_consumables`.`deleted_at` is null