app/Models/Category.php

select count(*) as aggregate from `stet_assets` inner join `stet_models` on `stet_models`.`id` = `stet_assets`.`model_id` where `stet_models`.`deleted_at` is null and `stet_models`.`category_id` = 2 and `stet_assets`.`deleted_at` is null
select count(*) as aggregate from `stet_accessories` where `stet_accessories`.`category_id` = 4 and `stet_accessories`.`category_id` is not null and `stet_accessories`.`deleted_at` is null
select count(*) as aggregate from `stet_licenses` where `stet_licenses`.`category_id` = 1 and `stet_licenses`.`category_id` is not null and `stet_licenses`.`deleted_at` is null
---
    public function itemCount()
    {
        switch ($this->category_type) {
            case 'asset':
                return $this->assets()->count();
            case 'accessory':
                return $this->accessories()->count();
            case 'component':
                return $this->components()->count();
            case 'consumable':
                return $this->consumables()->count();
            case 'license':
                return $this->licenses()->count();