app/Models/License.php

select count(*) as aggregate from `stet_license_seats` where `deleted_at` is null and `stet_license_seats`.`deleted_at` is null
---
    public static function assetcount()
    {
        return LicenseSeat::whereNull('deleted_at')
                   ->count();