app/Models/Setting.php

    public static function getSettings(): ?Setting
    {
        return Cache::rememberForever(self::APP_SETTINGS_KEY, function () {
            // Need for setup as no tables exist
            try {
                return self::first();
---
select * from `stet_settings` limit 1